import { ObjectData } from '../types';

export const INITIAL_OBJECTS: ObjectData[] = [
  {
    "id": "obj_001",
    "name": "Револьвер",
    "description": "Кинетическая ручная шестизарядная пушка крупного калибра. Старая школа. ",
    "connectionId": "char_1764641742185",
    "state": "Полностью заряжен"
  },
  {
    "id": "obj_002",
    "name": "Датапад",
    "description": "Стандартный полицейский планшет.",
    "connectionId": "char_001",
    "state": "Разбитый экран"
  },
  {
    "id": "obj_003",
    "name": "Бутылка виски",
    "description": "Дешевый синтетический алкоголь.",
    "connectionId": "char_001",
    "state": "разбита вдребезги, осколки повсюду"
  },
  {
    "id": "obj_1764621899013",
    "name": "Статуэтка в виде бюста Наполеона",
    "description": "небольшая гипсовая статуетка в виде бюста Наполеона, в которой обычно спрятан пакетик с травкой",
    "connectionId": "loc_001",
    "state": "Normal"
  },
  {
    "id": "obj_1764644027967_foh5",
    "name": "Осколки",
    "description": "Несколько острых осколков от разбитой бутылки виски.",
    "connectionId": "char_001",
    "state": "Острые"
  },
  {
    "id": "obj_1764644085541_jv8h",
    "name": "Пакетик с травкой",
    "description": "Небольшой герметичный пакетик с высушенными листьями неизвестного происхождения. Пахнет терпко и сладко.",
    "connectionId": "char_1764641742185",
    "state": "Запечатан"
  }
];
